INSERT INTO worker (name, birthday, level, salary) VALUES
  ('Олександр', '1990-05-15', 'Trainee', 800),
  ('Юлія', '1985-12-10', 'Junior', 1200),
  ('Максим', '1982-09-23', 'Middle', 2500),
  ('Оксана', '1978-07-18', 'Senior', 5000),
  ('Андрій', '1992-03-08', 'Middle', 3000),
  ('Софія', '1991-01-25', 'Trainee', 900),
  ('Іван', '1987-11-02', 'Junior', 1100),
  ('Олена', '1984-06-14', 'Senior', 4500),
  ('Володимир', '1979-04-07', 'Middle', 2800),
  ('Анастасія', '1989-02-28', 'Junior', 1500);

INSERT INTO client (name) VALUES
  ('КиївЕнерго'),
  ('Комфі'),
  ('Нова Пошта'),
  ('Укрзалізниця'),
  ('Укрпошта');

INSERT INTO project (client_id, start_date, finish_date) VALUES
  (1, '2023-01-01', '2023-04-15'),
  (2, '2022-11-10', '2023-02-28'),
  (3, '2023-03-15', '2023-07-31'),
  (4, '2023-02-01', '2023-05-20'),
  (5, '2022-12-20', '2023-06-30'),
  (1, '2023-05-01', '2024-01-15'),
  (3, '2023-06-10', '2023-09-30'),
  (2, '2023-04-15', '2023-07-31'),
  (4, '2023-03-01', '2023-06-20'),
  (5, '2023-01-20', '2023-07-15');

INSERT INTO project_worker (project_id, worker_id) VALUES
  (1, 1),
  (1, 2),
  (1, 3),
  (2, 1),
  (2, 2),
  (2, 3),
  (3, 2),
  (3, 3),
  (4, 4),
  (5, 10),
  (5, 5),
  (6, 7),
  (6, 3),
  (7, 4),
  (7, 5),
  (8, 6),
  (8, 7),
  (8, 8),
  (9, 9),
  (9, 10),
  (10, 1),
  (10, 2),
  (10, 3);

COMMIT;
